zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA174VFM-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA174VFM/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA344VLH-pinctrl.h with this part's differences applied
 * below (201 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 796e143b40c94355
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA174VFM_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA174VFM_WRAPPER_

#include "MCXA344VLH-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_A0_P2_0
#undef ADC0_A15_P0_6
#undef ADC0_A1_P2_4
#undef ADC0_A20_P1_4
#undef ADC0_A21_P1_5
#undef ADC0_A22_P1_6
#undef ADC0_A23_P1_7
#undef ADC0_A6_P2_16
#undef ADC1_A0_P2_1
#undef ADC1_A10_P1_12
#undef ADC1_A11_P1_13
#undef ADC1_A1_P2_5
#undef ADC1_A20_P3_31
#undef ADC1_A21_P3_30
#undef ADC1_A2_P2_19
#undef ADC1_A3_P2_6
#undef ADC1_A8_P1_10
#undef ADC1_A9_P1_11
#undef CAN0_RXD_P1_11
#undef CAN0_RXD_P1_12
#undef CAN0_RXD_P1_7
#undef CAN0_TXD_P1_10
#undef CAN0_TXD_P1_13
#undef CAN0_TXD_P1_6
#undef CLKOUT_P0_6
#undef CLKOUT_P3_6
#undef CMP0_IN2_P1_4
#undef CMP1_IN2_P1_5
#undef CMP1_INP4_P2_19
#undef CMP1_OUT_P0_6
#undef CMP2_IN0_P2_4
#undef CMP2_IN3_P1_2
#undef CMP2_INN4_P2_2
#undef CMP2_INP4_P2_6
#undef CT0_MAT0_P0_16
#undef CT0_MAT1_P0_17
#undef CT0_MAT2_P2_16
#undef CT0_MAT2_P3_30
#undef CT0_MAT3_P3_31
#undef CT1_MAT0_P2_4
#undef CT1_MAT1_P2_5
#undef CT1_MAT2_P1_4
#undef CT1_MAT2_P2_6
#undef CT1_MAT2_P3_12
#undef CT1_MAT3_P1_5
#undef CT1_MAT3_P3_13
#undef CT2_MAT0_P1_10
#undef CT2_MAT0_P2_0
#undef CT2_MAT1_P1_11
#undef CT2_MAT1_P2_1
#undef CT2_MAT2_P1_12
#undef CT2_MAT3_P1_13
#undef CT_INP14_P2_4
#undef CT_INP15_P2_5
#undef CT_INP16_P2_0
#undef CT_INP17_P2_1
#undef CT_INP18_P2_6
#undef CT_INP2_P0_6
#undef CT_INP6_P1_6
#undef CT_INP6_P3_14
#undef CT_INP7_P1_7
#undef CT_INP7_P3_15
#undef FREQME_CLK_IN0_P1_4
#undef FREQME_CLK_IN1_P1_5
#undef FREQME_CLK_OUT1_P3_6
#undef ISPMODE_N_P0_6
#undef LPI2C0_HREQ_P0_6
#undef LPI2C0_SCLS_P1_11
#undef LPI2C0_SCL_P0_17
#undef LPI2C0_SDAS_P1_10
#undef LPI2C0_SDA_P0_16
#undef LPI2C1_SCLS_P3_30
#undef LPI2C1_SCL_P1_13
#undef LPI2C1_SDAS_P3_31
#undef LPI2C1_SDA_P1_12
#undef LPSPI0_PCS1_P0_6
#undef LPSPI0_PCS1_P1_6
#undef LPSPI0_PCS2_P0_16
#undef LPSPI0_PCS2_P1_5
#undef LPSPI0_PCS3_P0_17
#undef LPSPI0_PCS3_P1_4
#undef LPSPI1_PCS1_P2_6
#undef LPSPI1_PCS2_P3_7
#undef LPSPI1_PCS3_P3_6
#undef LPSPI1_SDI_P2_16
#undef LPTMR0_ALT2_P3_31
#undef LPUART0_RXD_P2_0
#undef LPUART0_TXD_P2_1
#undef LPUART1_CTS_B_P1_11
#undef LPUART1_RTS_B_P1_10
#undef LPUART1_RTS_B_P2_16
#undef LPUART2_CTS_B_P1_7
#undef LPUART2_CTS_B_P2_4
#undef LPUART2_CTS_B_P3_13
#undef LPUART2_RTS_B_P1_6
#undef LPUART2_RTS_B_P2_5
#undef LPUART2_RTS_B_P3_12
#undef LPUART2_RXD_P1_12
#undef LPUART2_RXD_P1_4
#undef LPUART2_RXD_P3_14
#undef LPUART2_TXD_P1_13
#undef LPUART2_TXD_P1_5
#undef LPUART2_TXD_P3_15
#undef LPUART3_CTS_B_P3_14
#undef LPUART3_CTS_B_P3_7
#undef LPUART3_RTS_B_P3_15
#undef LPUART3_RTS_B_P3_6
#undef LPUART3_RXD_P3_13
#undef LPUART3_TXD_P3_12
#undef OPAMP1_INN_P2_17
#undef OPAMP1_INP_P2_16
#undef OPAMP1_OUT_P2_19
#undef OPAMP2_INN_P2_1
#undef OPAMP2_INP_P2_0
#undef OPAMP2_OUT_P2_6
#undef P0_16
#undef P0_17
#undef P0_6
#undef P1_10
#undef P1_11
#undef P1_12
#undef P1_13
#undef P1_4
#undef P1_5
#undef P1_6
#undef P1_7
#undef P2_0
#undef P2_1
#undef P2_16
#undef P2_19
#undef P2_4
#undef P2_5
#undef P2_6
#undef P3_12
#undef P3_13
#undef P3_14
#undef P3_15
#undef P3_30
#undef P3_31
#undef P3_6
#undef P3_7
#undef PWM0_A3_P3_6
#undef PWM0_B3_P3_7
#undef PWM0_X0_P3_12
#undef PWM0_X1_P3_13
#undef PWM0_X2_P3_14
#undef PWM0_X3_P3_15
#undef PWM1_A0_P3_30
#undef PWM1_A0_P3_6
#undef PWM1_A1_P3_14
#undef PWM1_A2_P3_12
#undef PWM1_B0_P3_31
#undef PWM1_B0_P3_7
#undef PWM1_B1_P3_15
#undef PWM1_B2_P3_13
#undef SMARTDMA_PIO0_P1_4
#undef SMARTDMA_PIO12_P3_12
#undef SMARTDMA_PIO13_P3_13
#undef SMARTDMA_PIO14_P3_14
#undef SMARTDMA_PIO15_P3_15
#undef SMARTDMA_PIO19_P2_16
#undef SMARTDMA_PIO1_P1_5
#undef SMARTDMA_PIO21_P2_19
#undef SMARTDMA_PIO24_P2_0
#undef SMARTDMA_PIO25_P2_1
#undef SMARTDMA_PIO28_P2_4
#undef SMARTDMA_PIO29_P2_5
#undef SMARTDMA_PIO2_P0_6
#undef SMARTDMA_PIO2_P1_6
#undef SMARTDMA_PIO30_P2_6
#undef SMARTDMA_PIO30_P3_30
#undef SMARTDMA_PIO31_P3_31
#undef SMARTDMA_PIO3_P1_7
#undef SMARTDMA_PIO6_P0_16
#undef SMARTDMA_PIO6_P1_10
#undef SMARTDMA_PIO6_P3_6
#undef SMARTDMA_PIO7_P0_17
#undef SMARTDMA_PIO7_P1_11
#undef SMARTDMA_PIO7_P3_7
#undef SMARTDMA_PIO8_P1_12
#undef SMARTDMA_PIO9_P1_13
#undef TRIG_IN10_P3_31
#undef TRIG_IN2_P1_6
#undef TRIG_IN2_P3_7
#undef TRIG_IN3_P1_13
#undef TRIG_IN6_P2_0
#undef TRIG_IN7_P2_1
#undef TRIG_OUT2_P1_11
#undef TRIG_OUT2_P1_7
#undef TRIG_OUT4_P2_6
#undef TRIG_OUT5_P2_19
#undef TRIG_OUT6_P3_30
#undef UTICK_CAP2_P0_16
#undef UTICK_CAP3_P0_17
#undef WUU0_IN11_P1_11
#undef WUU0_IN12_P1_12
#undef WUU0_IN18_P2_0
#undef WUU0_IN25_P3_14
#undef WUU0_IN2_P0_16
#undef WUU0_IN8_P1_4
#undef WUU0_IN9_P1_7

#endif /* _ZEPHYR_DTS_BINDING_MCXA174VFM_WRAPPER_ */
